close all
x=1999:2016;
t_a=[3.87 3.39 3.63 4.21 4.81 4.5 3.83 4.34 5.54 5.07 3.48 3.24 4.21 3.72 3.72 4.41 4.89 4.45];
t_spring=[3.41 5.93 5.72 7.85 7.32 5.82 4.86 5.39 5.29 7.96 6.12 3.04 5.18 5.72 4.57 6.99 6.42 7.33];
t_autumn=[4.78 4.04 6.02 2.46 5.08 6.42 6.24 5.54 5.5 5.11 4.05 4.82 6.02 5.27 5.61 5.81 4.97 3.25];
w_spring=[0.0 117.6 104.14 124.21 52.58 86.87 172.47 51.05 140.46 177.55 76.45 175.77 109.22 164.34 144.78 143.26 169.16 225.04];
w_autumn=[59.18 180.85 99.57 67.56 138.43 85.34 67.06 123.19 171.96 132.33 118.11 80.26 57.4 179.58 162.31 139.19 78.74 160.53];

%% 气温
subplot(1,2,1)
plot(x,t_a,'go-',x,t_spring,'bs-',x,t_autumn,'rd-',LineWidth=1)
title("气温数据")
legend("年平均气温","春季平均气温","秋季平均气温","Location","best")
xlim([1999 2016])
xticks(x)
xlabel("年份")
ylabel("气温（单位：℃）")
set(gcf,'Position',[100,300,1000,400]);

%% 降水
subplot(1,2,2)
plot(x,w_spring,'bs-',x,w_autumn,'rd-',LineWidth=1)
title("降水量数据")
legend("春季降水量","秋季降水量","Location","best")
xlim([1999 2016])
xticks(x)
xlabel("年份")
ylabel("降水量（单位：mm）")